SilentWolf75/Display-for-Tempest-Weather-Station/firmware/sdkconfig.defaults
# ---------------------------------------------------------------------------
# CrowPanel Advance 10.1" (ESP32-P4 + ESP32-C6) — project defaults
# Regenerate sdkconfig by deleting it and rebuilding; do not commit sdkconfig.
# ---------------------------------------------------------------------------

CONFIG_IDF_TARGET="esp32p4"

# --- Silicon revision ---
# IDF 5.5.3 defaults to ESP32P4_REV_MIN_301 (v3.01). The ESP32-P4 Elecrow
# fitted to this panel is revision **v1.3**, so the stock bootloader refuses to
# flash:
#   "bootloader.bin requires chip revision in range [v3.1 - v3.99]
#    (this chip is revision v1.3)"
# Espressif treats pre-3.0 and 3.0+ as two incompatible hardware branches, and
# hides the older revisions behind ESP32P4_SELECTS_REV_LESS_V3 (default n).
# Both symbols are required: without the gate, CONFIG_ESP32P4_REV_MIN_100 is
# not even a valid choice and is silently dropped from sdkconfig.
#
# Do NOT "fix" this with esptool --force: that flashes a bootloader built with
# ECO workarounds and ROM entry points this silicon does not have.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# --- OTA ---
# Roll back automatically if a freshly flashed image never marks itself valid.
# Without this a bad update means physically retrieving a wall-mounted panel.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# --- Flash / partitions ---
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
# The OTA-capable bootloader grew to within 256 bytes of the default 0x7000
# budget. Moving the partition table to 0xA000 gives it 0x9000 instead, which
# is cheap insurance -- overflowing it is a hard build failure with a cryptic
# message. Offsets in partitions.csv shift to match.
CONFIG_PARTITION_TABLE_OFFSET=0xA000
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- PSRAM: 32 MB, needed for the 1024x600 framebuffers ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# The 200 MHz PSRAM setting the Elecrow wiki calls for is gated behind this.
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# --- CPU ---
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_400=y

# --- Networking is proxied to the ESP32-C6 over SDIO (ESP-Hosted) ---
CONFIG_ESP_WIFI_REMOTE_ENABLED=y

# --- ESP-Hosted SDIO link to the ESP32-C6 -----------------------------------
# These come from Elecrow's own firmware upgrade guide
# ("CrowPanel_Advance_ESP32-P4 Display_Firmware_Upgrade_Guide-ESP_IDF
# platform.pdf"), which states outright: "Pin assignments vary by hardware
# version" and then lists a DIFFERENT set per panel size and revision.
#
# The 10.1 inch uses a **1-bit** SDIO bus. The component default is 4-bit, and
# the failure that produces is deceptive: enumeration only needs CMD and CLK,
# so "Card init success" is printed and the card reports its block sizes --
# then every data transfer times out on the unconnected D2/D3 lines:
#     sdmmc_io_rw_extended: sdmmc_send_cmd returned 0x107
#     H_SDIO_DRV: failed to read registers
#     H_SDIO_DRV: Host is reseting itself
# and ESP-Hosted reboots the whole board, forever.
#
# The slave reset line is GPIO 32, not the component default of 54, so the C6
# was also never actually being reset.
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
CONFIG_ESP_HOSTED_SDIO_1_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_BUS_WIDTH=1
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CMD_SLOT_1=19
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CLK_SLOT_1=18
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D0_SLOT_1=14
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D1_1BIT_BUS_SLOT_1=15
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=32
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y

# ###########################################################################
# Networking is compiled out until the C6 co-processor works.
#
# The SDIO settings above are CORRECT and verified against Elecrow's guide:
# the card enumerates, reports its block sizes and opens a data path. What
# never happens is the slave announcing itself ready, across host versions
# 2.7.4, 2.12.3, 2.12.12 and 3.0.6. That isolates the fault to the firmware
# running on the C6.
#
# ESP-Hosted responds to the failure by restarting the P4 every ~15 s, which
# makes the panel flash continuously, so it cannot simply be left enabled and
# ignored. Set this back to y once the C6 is running Elecrow's
# network_adapter.bin (ESP-Hosted 2.12.3).
# ###########################################################################
CONFIG_TEMPEST_NETWORK_ENABLED=n

# ESP-Hosted warns about this itself at boot:
#   "CONFIG_FREERTOS_HZ is 100, ESP-Hosted recommended 1000, to avoid bus
#    level jitters"
# At 100 Hz the SDIO transfers to the C6 time out (sdmmc_send_cmd 0x107) and
# the slave never becomes ready. A 1 ms tick costs a little scheduling
# overhead and buys a working radio.
CONFIG_FREERTOS_HZ=1000


# UDP broadcast ingest: make sure LwIP is not the thing that drops our frames.
# The default UDP PCB / mbox sizes are tight for a 3-second rapid_wind stream
# sharing the stack with a TLS forecast poll.
CONFIG_LWIP_MAX_UDP_PCBS=16
CONFIG_LWIP_UDP_RECVMBOX_SIZE=16
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_SO_RCVBUF=y
CONFIG_LWIP_IP_FORWARD=n
CONFIG_LWIP_NETIF_LOOPBACK=y

# SNTP — needed for sunrise/sunset and "last updated" staleness.
CONFIG_LWIP_SNTP_MAX_SERVERS=2

# --- TLS for the REST forecast poll ---
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_ESP_TLS_INSECURE=n

# --- Main task needs room for LVGL setup ---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# --- Logging: verbose while bringing the board up, drop to INFO later ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# --- Panic behaviour: print a backtrace instead of silently rebooting ---
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y

# --- LVGL: enable only the Montserrat sizes ui.c actually references ---
# Each font costs flash, so this list is the UI's font budget. Adding a size to
# ui.c without adding it here fails the build with "undeclared identifier".
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_34=y
CONFIG_LV_FONT_MONTSERRAT_38=y
CONFIG_LV_FONT_MONTSERRAT_46=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y

# LVGL colour depth must match the panel and the lvgl_port display config.
CONFIG_LV_COLOR_DEPTH_16=y

# 50 ms refresh. A weather panel that changes once a second does not need the
# default 33 ms, and every refresh costs real work on this CPU.
CONFIG_LV_DEF_REFR_PERIOD=50

# Draw buffers live in PSRAM; LVGL needs to know it may use it.
CONFIG_LV_USE_PERF_MONITOR=n
CONFIG_LV_USE_MEM_MONITOR=n

# --- Animated Lottie weather icons via ThorVG ---
# lv_lottie needs the vector graphics pipeline plus a ThorVG backend.
# ThorVG is a C++ vector renderer; this is the single biggest optional cost in
# the build, which is why it is grouped and commented rather than sprinkled.
CONFIG_LV_USE_VECTOR_GRAPHIC=y
CONFIG_LV_USE_THORVG=y
CONFIG_LV_USE_THORVG_INTERNAL=y
CONFIG_LV_USE_LOTTIE=y
CONFIG_LV_USE_MATRIX=y

# --- SPIFFS: the icon partition ---
# Default object-name length is 32 chars, and paths like
# "/icons/possibly-thunderstorm-day.json" are 37. spiffsgen enforces this at
# build time, so a too-long slug fails the build rather than the device.
CONFIG_SPIFFS_OBJ_NAME_LEN=64
CONFIG_SPIFFS_PAGE_CHECK=y
